In [9]:
import pandas as pd
# import mysql.connector as sql
import sqlite3

from sqlalchemy import create_engine

In [20]:
data_credit_profiles = pd.read_csv('./Data/credit_profiles.csv')
data_credit_profiles.head(3)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
0,1,749,0.585171,19571.0,0.0,40000.0
1,2,587,0.107928,161644.0,2.0,1250.0
2,3,544,0.854807,513.0,4.0,1000.0

In [24]:
data_credit_profiles.shape

(1004, 6)

In [22]:
data_customers = pd.read_csv('./Data/customers.csv')
data_customers.head(3)

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married

In [25]:
data_customers.shape

(1000, 8)

In [23]:
data_transactions = pd.read_csv('./Data/transactions.csv')
data_transactions.head(3)

,tran_id,cust_id,tran_date,tran_amount,platform,product_category,payment_type
0,1,705,2023-01-01,63,Flipkart,Electronics,Phonepe
1,2,385,2023-01-01,99,Alibaba,Fashion & Apparel,Credit Card
2,3,924,2023-01-01,471,Shopify,Sports,Phonepe

In [26]:
data_transactions.shape

(500000, 7)

In [ ]:
# engine = create_engine('mysql+pymysql://root:juud@host:3306/e_master_card')